Revit 2027 API
ConduitSizes.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<ConduitSize> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of ConduitSize)
public:
virtual IEnumerator<ConduitSize^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<ConduitSize>
override GetEnumerator : unit -> IEnumerator<ConduitSize>
Return Value
IEnumerator<ConduitSize>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace